In [1]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [3]:
animals = DataFrame(np.arange(16).reshape(4,4), columns = ['W','X','Y','Z'],
                    index = ['Dog','Cat','Bird','Mouse'])

In [6]:
animals

        W   X   Y   Z
Dog     0   1   2   3
Cat     4   5   6   7
Bird    8   9  10  11
Mouse  12  13  14  15

In [8]:
animals.ix[1:2, ['W','Y']] = np.nan

In [9]:
animals

        W   X   Y   Z
Dog     0   1   2   3
Cat   NaN   5 NaN   7
Bird    8   9  10  11
Mouse  12  13  14  15

In [22]:
animals.ix[0:1]

     W  X  Y  Z
Dog  0  1  2  3

In [23]:
behavior_map = {'W':'good','X':'bad','Y':'good','Z':'bad'}

In [25]:
animal_col = animals.groupby(behavior_map, axis = 1)

In [27]:
animal_col.sum()

       bad  good
Dog      4     2
Cat     12   NaN
Bird    20    18
Mouse   28    26

In [28]:
behav_series = Series(behavior_map)

In [29]:
behav_series

W    good
X     bad
Y    good
Z     bad
dtype: object

In [31]:
animals.groupby(behav_series,axis = 1).count(0)

       bad  good
Dog      2     2
Cat      2     0
Bird     2     2
Mouse    2     2

In [33]:
animals

        W   X   Y   Z
Dog     0   1   2   3
Cat   NaN   5 NaN   7
Bird    8   9  10  11
Mouse  12  13  14  15

In [34]:
animals.groupby(len).sum()

    W   X   Y   Z
3   0   6   2  10
4   8   9  10  11
5  12  13  14  15

In [35]:
len(animals.index[0])

3

In [45]:
keys = ['A','C','A','B']
animals.groupby([len, keys]).count()

     W  X  Y  Z
3 A  1  1  1  1
  C  0  1  0  1
4 A  1  1  1  1
5 B  1  1  1  1

In [46]:
keys = ['A','A','A','B']
animals.groupby([len, keys]).count()

     W  X  Y  Z
3 A  1  2  1  2
4 A  1  1  1  1
5 B  1  1  1  1

In [47]:
keys = ['A','A','A','B']
animals.groupby([len, keys]).max()

      W   X   Y   Z
3 A   0   5   2   7
4 A   8   9  10  11
5 B  12  13  14  15

In [49]:
hier_col = pd.MultiIndex.from_arrays([['NY','NY','NY','SF','SF'],[1,2,3,1,2]],
                                      names = ['City','sub_value'])

In [50]:
hier_col

MultiIndex(levels=[[u'NY', u'SF'], [1, 2, 3]],
           labels=[[0, 0, 0, 1, 1], [0, 1, 2, 0, 1]],
           names=[u'City', u'sub_value'])

In [51]:
dframe_hr = DataFrame(np.arange(25).reshape(5,5),columns = hier_col)
dframe_hr

City       NY          SF
sub_value   1   2   3   1   2
0           0   1   2   3   4
1           5   6   7   8   9
2          10  11  12  13  14
3          15  16  17  18  19
4          20  21  22  23  24

In [53]:
dframe_hr = dframe_hr*100
dframe_hr

City           NY                      SF
sub_value       1       2       3       1       2
0               0   10000   20000   30000   40000
1           50000   60000   70000   80000   90000
2          100000  110000  120000  130000  140000
3          150000  160000  170000  180000  190000
4          200000  210000  220000  230000  240000

In [92]:
aaa = dframe_hr['SF']

In [93]:
aaa.groupby(1).sum()

sub_value       2
1
30000       40000
80000       90000
130000     140000
180000     190000
230000     240000